package peaksoft;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class
FinalProjectApplication {

    public static void main(String[] args) {
        SpringApplication.run(FinalProjectApplication.class, args);
    }


    /** Ресторан
     CRUD
     Бир ресторанда максимум 15 сотрудник иштей алат, учурда канча сотрудник иштеп атканы корунуп туруш керек
     15 тен коп сотрудник болсо , ваканция жок деп чыксын
     User
     CRUD
     Admin дефолтно сакталсын.
     Сотрудниктер Админ тарабынан тузулгондо ресторанга тиешелуу болуп тузулсун
     Сотрудниктер оздору ресторанга заявка жиберет , заявканы админ кабыл алат же албайт. Кабыл алса сотрудник ресторанга assign болот, албаса базадан очуп кетсин.
     Сотрудниктер заявка толтуруп жаткандагы шарттар:
     email уникальный болуш керек
     Повардын жашы 25 тен 45 жашка чейин болсун
     Официанттын жашы 18 ден 30 жашка чейин болсун
     Иштоо стаждары официанттыкы 1 жыл, повардыкы 2 жыл болсун
     Телефон номерлерде валидация болсун
     Password 4 символдон коп болсун
     Полелер null болбосун
     Category
     СRUD
     SubCategory
     Сабкатегория бир категорияга тиешелуу болуп тузулсун
     CRUD
     Бир категоряга тиешелуу сабкатегорияларды ала алышыбыз керек(атына жараша сорттолуп чыксын)
     Сабкатегорялар категориясына жараша группировка болуп чыксын
     MenuItem
     Менюну Повар жана админ тузо алат
     Меню тузулгондо ресторанга тузулушу керек
     Менюдагы тамактын баасы минус сан болбош керек
     CRUD
     Global search (bir tamgany jazganda oshol tamgalar bar tamaktar chyksyn, catgeroiya jana sabkategoriyaga da tiyesheluu)
     Баасына жараша сортировка болсун(кымбаттан арзанга, арзандан кымбатка)
     IsVegeterian полеси аркылуу фильтрация болсун
     StopList
     StopList ти админ жана повар тузо алат
     StopList тузуп жатканда кайсыл тамак жок экндигин беришибиз керек
     CRUD
     StopList тузуп жатканда бир дата менен бир тамак бир эле жолу сакталыш керек
     Cheque
     Чек ти админ жана официант тузо алат
     Response аркылуу :
     Waiter’s fullName
     List<MenuItem>items
     Avarage price
     Service %
     Grand total
     Бир официанттын бир кундук общий чектеринин жалпы суммасын чыгарган метод болсун
     CRUD
     Чекти админ гана озгортуп жана очуро алсын
     Ресторандын бир кундук чектеринин жалпы орточо суммасын чыгара алышыбыз керек. Админ гана чыгара алат **/
}
